# Pandas
### [Documentation](https://pandas.pydata.org/docs/)

Installation using pip package installer and terminal:

`pip install pandas`

In [11]:
import numpy as np
from numpy.random import randn
import pandas as pd
from sqlalchemy import create_engine

np.random.seed(101)

### Series

In [3]:
labels = ['a', 'b', 'c']
ls = [10,20,30]
arr = np.array([10,20,30])
dic = {'a': 10, 'b': 20, 'c':100}

In [4]:
# Create a series using various objects
pd.Series(ls, labels)

a    10
b    20
c    30
dtype: int64

In [5]:
 pd.Series(dic)

a     10
b     20
c    100
dtype: int64

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [7]:
pd.Series([sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [8]:
ser1 = pd.Series([1,2,3,4], index=['Canada','UAE', 'France', 'Japan'])
ser1

Canada    1
UAE       2
France    3
Japan     4
dtype: int64

In [9]:
ser2 = pd.Series([1,2,3,4], index=['Canada','USA', 'Germany', 'Japan'])
ser2

Canada     1
USA        2
Germany    3
Japan      4
dtype: int64

In [10]:
# Select the data of a label
ser1['Canada']

1

In [11]:
ser2['USA']

2

In [12]:
# Add to series
ser1 + ser2

Canada     2.0
France     NaN
Germany    NaN
Japan      8.0
UAE        NaN
USA        NaN
dtype: float64

### DataFrames

In [13]:
# Create a dataframe
df = pd.DataFrame(randn(5,4), ['A','B','C','D', 'E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [14]:
# Select a column
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [15]:
# A dataframe is a collection of series that share the same index
type(df['W'])

pandas.core.series.Series

In [16]:
# Ask for multiple columns
df[['X','W']]

          X         W
A  0.628133  2.706850
B -0.319318  0.651118
C  0.740122 -2.018168
D -0.758872  0.188695
E  1.978757  0.190794

In [17]:
# Create a new column
df['V'] = "True"
df

          W         X         Y         Z     V
A  2.706850  0.628133  0.907969  0.503826  True
B  0.651118 -0.319318 -0.848077  0.605965  True
C -2.018168  0.740122  0.528813 -0.589001  True
D  0.188695 -0.758872 -0.933237  0.955057  True
E  0.190794  1.978757  2.605967  0.683509  True

In [18]:
# Remove column
df.drop('V', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
# Drop doesn't happen inplace
df

          W         X         Y         Z     V
A  2.706850  0.628133  0.907969  0.503826  True
B  0.651118 -0.319318 -0.848077  0.605965  True
C -2.018168  0.740122  0.528813 -0.589001  True
D  0.188695 -0.758872 -0.933237  0.955057  True
E  0.190794  1.978757  2.605967  0.683509  True

In [20]:
# Set inplace=True to change it in place
df.drop('E', inplace=True)
df

          W         X         Y         Z     V
A  2.706850  0.628133  0.907969  0.503826  True
B  0.651118 -0.319318 -0.848077  0.605965  True
C -2.018168  0.740122  0.528813 -0.589001  True
D  0.188695 -0.758872 -0.933237  0.955057  True

In [21]:
df.shape

(4, 5)

In [22]:
# Select a row using label based index
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
V        True
Name: C, dtype: object

In [23]:
# Select a row using numerical based index
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
V        True
Name: C, dtype: object

In [24]:
# Select a subset of rows and columns
df.loc['B', 'Y']

-0.8480769834036315

In [25]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

#### Conditional Selection in DataFrames

In [26]:
df = pd.DataFrame(randn(5,4), ['A','B','C','D', 'E'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [27]:
# Conditional selction on the entire dataframe, will return dataframe with null values
booldf = df > 0
df[booldf]
df[df > 0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [28]:
# Conditional selection using columns, returns series values and no nulls
df[df['W'] > 0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [29]:
df[df['W']>0][['X', 'Y']]

          X         Y
A  1.693723 -1.706086
C  0.072960  0.638787

In [30]:
# Multiple conditions
df[(df['W']>0) & (df['Y']>1)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [31]:
# Reseting the indices, not inplace
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [32]:
new_index = 'CA NY WY OR CO'.split()
df['States'] = new_index
df

          W         X         Y         Z States
A  0.302665  1.693723 -1.706086 -1.159119     CA
B -0.134841  0.390528  0.166905  0.184502     NY
C  0.807706  0.072960  0.638787  0.329646     WY
D -0.497104 -0.754070 -0.943406  0.484752     OR
E -0.116773  1.901755  0.238127  1.996652     CO

In [33]:
# Set a column to be the new index, not inplace
df.set_index('States')

               W         X         Y         Z
States
CA      0.302665  1.693723 -1.706086 -1.159119
NY     -0.134841  0.390528  0.166905  0.184502
WY      0.807706  0.072960  0.638787  0.329646
OR     -0.497104 -0.754070 -0.943406  0.484752
CO     -0.116773  1.901755  0.238127  1.996652

In [34]:
# Create a multi index dataframe
outside = ['G1', 'G1', 'G1','G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
higher_index = list(zip(outside, inside))
higher_index = pd.MultiIndex.from_tuples(higher_index)

In [35]:
df = pd.DataFrame(randn(6,2), higher_index, ['A', 'B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

In [36]:
# select a row using index hierarchy 
df.loc['G1'].loc[1]

A   -0.993263
B    0.196800
Name: 1, dtype: float64

In [37]:
# Select a column using index hierarchy
df.loc['G2'].loc[2]['B']

-0.6102588558227414

In [38]:
# Naming the inside and outside indices
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
G1     1   -0.993263  0.196800
       2   -1.136645  0.000366
       3    1.025984 -0.156598
G2     1   -0.031579  0.649826
       2    2.154846 -0.610259
       3   -0.755325 -0.346419

In [39]:
# Cross section of rows and columns
df.xs(1, level='Num')

               A         B
Groups
G1     -0.993263  0.196800
G2     -0.031579  0.649826

### Missing Data

In [40]:
dic = {'A':[1,2,np.nan] ,'B':[5, np.nan, np.nan] ,'C':[1,2,3]}
df = pd.DataFrame(dic)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [41]:
# Drop rows with null or missing values
df.dropna()

     A    B  C
0  1.0  5.0  1

In [42]:
# Drop columns with null or missing values
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [43]:
# Modify the threshhold for dropping null values
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [44]:
# Fill in the missing values with a specific value
df.fillna(value="value")

       A      B  C
0    1.0    5.0  1
1    2.0  value  2
2  value  value  3

In [45]:
# Fill in the missing values with the mean of the values
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### GroupBy

In [46]:
data ={'Company':['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
      'Person':['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
      'Sales':[200, 120, 340, 124, 243, 350]}

In [47]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [48]:
byCompany = df.groupby('Company')

In [49]:
byCompany.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [50]:
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [51]:
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [52]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [53]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [54]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [55]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [56]:
df.groupby('Company').min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [57]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [58]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

### Concatenating, Merging, and Joining

In [59]:
df1 = pd.DataFrame({'A':['A0', 'A1', 'A2', 'A3'],
                   'B':['B0', 'B1', 'B2', 'B3'],
                   'C':['C0', 'C1', 'C2', 'C3'],
                   'D':['D0', 'D1', 'D2', 'D3']},
                  index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [60]:
df2 = pd.DataFrame({'A':['A4', 'A5', 'A6', 'A7'],
                   'B':['B4', 'B5', 'B6', 'B7'],
                   'C':['C4', 'C5', 'C6', 'C7'],
                   'D':['D4', 'D5', 'D6', 'D7']},
                  index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [61]:
df3 = pd.DataFrame({'A':['A8', 'A9', 'A10', 'A11'],
                    'B':['B8', 'B9', 'B10', 'B11'],
                    'C':['C8', 'C9', 'C10', 'C11'],
                    'D':['D8', 'D9', 'D10', 'D11']}, 
                   index=[8, 9, 10, 11])
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Concatenation
Concatenation glues the dataframes together. Note that dimensions should match along the axis that are being concatenated.

In [62]:
# Concatenate along the rows
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [63]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#### Merging

In [64]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [65]:
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [66]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [67]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K1'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                     'A': ['A1', 'A2', 'A3', 'A4'],
                     'B': ['B1', 'B2', 'B3', 'B4']})
left

  key1 key2   A   B
0   K0   K0  A1  B1
1   K0   K1  A2  B2
2   K1   K0  A3  B3
3   K1   K1  A4  B4

In [68]:
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K3'],
                      'key2': ['K0', 'K0', 'K0', 'K0'],
                     'C': ['C0', 'C1', 'C2', 'C3'],
                     'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K3   K0  C3  D3

In [69]:
# Merging using multiple keys
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A1  B1  C0  D0
1   K1   K0  A3  B3  C1  D1
2   K1   K0  A3  B3  C2  D2

In [70]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A1   B1   C0   D0
1   K0   K1   A2   B2  NaN  NaN
2   K1   K0   A3   B3   C1   D1
3   K1   K0   A3   B3   C2   D2
4   K1   K1   A4   B4  NaN  NaN
5   K3   K0  NaN  NaN   C3   D3

In [71]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A1   B1  C0  D0
1   K1   K0   A3   B3  C1  D1
2   K1   K0   A3   B3  C2  D2
3   K3   K0  NaN  NaN  C3  D3

In [72]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0   K0   K0  A1  B1   C0   D0
1   K0   K1  A2  B2  NaN  NaN
2   K1   K0  A3  B3   C1   D1
3   K1   K0  A3  B3   C2   D2
4   K1   K1  A4  B4  NaN  NaN

#### Joining 
Similar to merge but the keys are indices

In [73]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                      'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [74]:
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                     'D': ['D0', 'D2', 'D3']},
                    index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [75]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [76]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operations

In [77]:
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [444,555,666,444],
                  'col3': ['abc', 'def', 'ghi', 'xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [78]:
# Finding unique values in a dataframe
len(df['col2'].unique())

3

In [79]:
df['col2'].nunique()

3

In [80]:
# Count how many times a value shows up
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [81]:
# Applying a custom function
def times3(x):
    return x*2
df['col1'].apply(times3)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [82]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [83]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [84]:
# Columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [85]:
# Indices
df.index

RangeIndex(start=0, stop=4, step=1)

In [86]:
# Sort by column
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [87]:
# Pivot table
data = {'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
       'B': ['one', 'one', 'two', 'two', 'one', 'one'],
       'C': ['x', 'y', 'x', 'y', 'x', 'y'],
       'D': [1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [88]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

### Data Input/Output
- CSV
- Excel
- HTML
- SQL

In [112]:
# I/O CSV file
pd.read_csv('../sample-files/sample.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [14]:
df = pd.read_csv('../sample-files/sample.csv')
df.to_csv('../sample-files/output.csv',index=False)
pd.read_csv('../sample-files/output.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [15]:
# I/O for Excel files requires openpyxl library
# Install using pip: pip install openpyxl
pd.read_excel('../sample-files/Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [16]:
df.to_excel('../sample-files/Excel_output.xlsx', sheet_name='new-sheet')

In [5]:
# I/O for HTML files requires html5lib, lxml, and BeautifulSoup4
# Installation using pip: pip install html5lib
# pip install lxml
# pip install BeautifulSoup4
# Then restart Jupyter notebook
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')
type(data)

list

In [8]:
data[0]

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [9]:
data[0].head()

,Bank Name,City,State,Cert,Acquiring Institution,Closing Date
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020"
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020"
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"

In [12]:
# I/O for SQL files requires sqlalchemy library
# Installation using pip: pip install sqlalchemy
# Create a simple SQL engine in memory
engine = create_engine('sqlite:///:memory:')

In [17]:
# Write a dataframe to the engine
df.to_sql('sample_table', engine)

In [19]:
sqldf = pd.read_sql('sample_table', con=engine)
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15